# Importing the Training and test Data

In [12]:
import pandas as pd

train = pd.read_csv(r'C:\Users\Katta\Downloads\titanic\train.csv')
test = pd.read_csv(r'C:\Users\Katta\Downloads\titanic\test.csv')
pass_ids = test['PassengerId']
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Cleaning the Data :
    1. Filling the NaN values
    2. Dropping the Independent columns

In [13]:
def clean(data):
    data.drop(['Cabin','Name','Ticket','Embarked'],axis=1,inplace=True)
    
    for col in ['Parch','Age','SibSp','Fare']:
        data[col].fillna(data[col].mean(),inplace=True)
    
    return data

train = clean(train)
test = clean(test)
train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

# Encoding the Categorical Data to Numerical Data
    you can also use pd.get_dummies() function

In [14]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
train['Sex'] = le.fit_transform(train['Sex'])
test['Sex'] = le.transform(test['Sex'])

test.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0          892       3    1  34.5      0      0   7.8292
1          893       3    0  47.0      1      0   7.0000
2          894       2    1  62.0      0      0   9.6875
3          895       3    1  27.0      0      0   8.6625
4          896       3    0  22.0      1      1  12.2875

# Importing the Required Modules for Training and Testing

In [15]:
from sklearn.model_selection import train_test_split

from sklearn.linear_model import LogisticRegression

# Splitting the data into train, test data

In [16]:
y = train['Survived']
X = train.drop("Survived",axis=1)
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=78)

# Defining a classifier and training it with the train split

In [17]:
clf = LogisticRegression(random_state=0,max_iter=1000).fit(X_train,y_train)

# Checking the Accuracy of the model

In [18]:
from sklearn.metrics import accuracy_score
pred = clf.predict(X_test)
accuracy_score(y_test,pred)

0.8268156424581006

# Predicting the values for the Test DataFrame

In [19]:
sub_pred = clf.predict(test)

# Storing these predictions in a DataFrame and exporting it as a csv file.

In [22]:
df = pd.DataFrame({'PassengerId':pass_ids.values,'Survived':sub_pred})
df.to_csv('titanic_sub.csv',index=False)

    PassengerId  Survived
0           892         0
1           893         0
2           894         0
3           895         0
4           896         1
5           897         0
6           898         1
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1
16          908         0
17          909         0
18          910         1

# Now you can upload this csv file as your submission. 
# THANK YOU